IDEA Open Model
StageLoading.PermanentForces Property
Compatible with IDEA StatiCa v 10.1
 Primary internal force in section
 Namespace: IdeaRS.OpenModel.Concrete.Load
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public ResultOfInternalForces PermanentForces { get; set; }
Public Property PermanentForces As ResultOfInternalForces
	Get
	Set
public:
property ResultOfInternalForces^ PermanentForces {
	ResultOfInternalForces^ get ();
	void set (ResultOfInternalForces^ value);
}
Property Value
Type: ResultOfInternalForces
See Also
Reference
StageLoading Class
IdeaRS.OpenModel.Concrete.Load Namespace